app/views/articles/show.html.erb

						</li>
						<li><small><%= pluralize(@article.user.articles.count, "articles") if @article.user.articles %></small></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 8]]