app/views/users/show.html.erb


<% if @user.articles.any? %>
---
SELECT  1 AS one FROM "articles" WHERE "articles"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]