app/controllers/articles_controller.rb

	def create
		debugger
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Title of article"], ["description", "Body of article to test user"], ["created_at", "2018-03-28 14:42:21.625433"], ["updated_at", "2018-03-28 14:42:21.625433"], ["user_id", 2]]